<?php
/**
 * 核心配置文件 您可以选择性的利用大C函数覆盖重写
 */
return [
    /*-------------------数据库配置-------------------*/
    /**
     * PDO
     */
    'DB_DSN'    => 'mysql:host=127.0.0.1;dbname=taskoft',
    /**
     * 用户名
     */
    'DB_USER'   => 'root',
    /**
     * 密码
     */
    'DB_PWD'    => '',
    /**
     * 表前缀
     */
    'DB_PREFIX' => 'gw_',
    /**
     * 字符集
     */
    'DB_CHARSET'=> 'utf8',
    /*-------------------view层配置-------------------*/
    /**
     * 设置视图层默认存储目录
     */
    // 'VIEW_TMPL_PATH' => DIR_VIEW,
    /**
     * 设置视图层文件后缀 多个以逗号分隔
     */
    'VIEW_SUFFIX' => '.php',
];